[
	{
		"title": "Should you follow up after every job application?",
		"exerpt": "Application follow-up",
		"content": "Searching for a job can be stressful. When you find a job you think you'd really like, it can feel like one wrong move can spell disaster. While this usually is not the case, it does lead many to question when following up with a potential employer is appropriate. And though there aren't any universal rules on the subject, here are some guidelines to help you determine whether to reach out. Many employers have automated systems that will send a confirmation email when your application has been received – so if you haven't heard back with 24 hours of submitting, it's worth checking in.Employers are looking for workers who are genuinely excited about the position, and following up is one of the easiest and most effective ways to demonstrate just how interested you are.After an interview, it's always a good idea to send a thank-you note or email to the individuals you met with. According to Penny Locey, vice president of Keystone Associates, job seekers should send in a thank you within 24 hours of the interview.As with anything, it is possible to follow up too much. Following up can demonstrate your interest, but overdoing it can make you come off as desperate or inconsiderate."
	}, {
		"title": "Put your mathematical skills to work as a bank teller",
		"exerpt": "Mathematocal skills",
		"content": "Most adults have met bank tellers while involved in their weekend errands or opening bank accounts. Tellers process transactions at the bank, whether the customer wants to deposit funds, cash a check, or withdraw money. In many ways, a bank teller's job mimics the responsibilities of a cashier at the supermarket except that transactions don't include milk cartons or deli meats. Some bank tellers aspire to greater responsibilities at work, while others intend to spend their careers behind the service desk. Either way, this career choice offers opportunities for advancement and a chance to work with other banking professionals.Bank tellers work in banks, credit unions, and other financial services institutions. This job is an indoor job, which means you'll enjoy a climate-controlled environment, although you might have to stand for long periods during the day. Traffic can vary widely at different banks. Some institutions might experience an almost endless number of customers who need help from tellers, while other banks may experience some downtime over the course of operating hours."
	}, {
		"title": "Want to know where the jobs will (and won't) be in 2021?",
		"exerpt": "Predicting 2021",
		"content": "Not every occupation can add new jobs as the economy grows. Some are being replaced by advances in technology – like travel agents and printing press operators, while other jobs are lost due to a shift in public behavior – like how doing your taxes online will lead to less demand of accountants. According to CareerBuilder and Emsi research, high-wage and low-wage occupations are each projected to grow 5 percent from 2016 to 2021, but middle-wage jobs are only estimated to grow 3 percent. At the same time, 61 percent of the 173 occupations expected to lose jobs over the next five years are in the middle-wage category.Keep a lookout for opportunities to learn new and exciting skills that may be able to boost your job prospects in the future. Programs like RightSkill by CareerBuilder and Capella Education."
	}
]
